<!doctype html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.1.3/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-1BmE4kWBq78iYhFldvKuhfTAU6auU8tT94WrHftjDbrCEXSU1oBoqyl2QvZ6jIW3" crossorigin="anonymous">
    <title>星座解析</title>
    <link href="index.css" rel="stylesheet">
  </head>
  <body>
      <header>
          12星座知多少
        </header>
        <div class="star">
            <select>
                <option value="請選擇你的星座">請選擇你的星座</option>
                 <option value="摩羯座">摩羯座</option>
                 <option value="射手座">射手座</option>
                 <option value="天瓶座">天秤座</option>
                 <option value="雙子座">雙子座</option>
                 <option value="獅子座">獅子座</option>
                 <option value="處女座">處女座</option>
                 <option value="金牛座">金牛座</option>
                 <option value="巨蟹座">巨蟹座</option>
                 <option value="牡羊座">牡羊座</option>
                 <option value="雙子座">雙子座</option>
                 <option value="雙魚座">雙魚座</option>
                 <option value="水瓶座">水瓶座</option>
             </select>
            <button onclick="add(number);">送出</button>
        </div>
      <div class="content">
        <nav>
          <ul>
            <li><a href="#" onclick="toggleMenu(1);">摩羯座</a></li>
            <li><a href="#" onclick="toggleMenu(2);">射手座</a></li>
            <li><a href="#"onclick="toggleMenu(3);">天秤座</a></li>
            <li><a href="#"onclick="toggleMenu(4);">雙子座</a></li>
            <li><a href="#"onclick="toggleMenu(5);">獅子座</a></li>
            <li><a href="#"onclick="toggleMenu(6);">處女座</a></li>
            <li><a href="#"onclick="toggleMenu(7);">金牛座</a></li>
            <li><a href="#"onclick="toggleMenu(8);">巨蟹座</a></li>
            <li><a href="#"onclick="toggleMenu(9);">牡羊座</a></li>
            <li><a href="#"onclick="toggleMenu(10);">雙子座</a></li>
            <li><a href="#"onclick="toggleMenu(11);">雙魚座</a></li>
            <li><a href="#"onclick="toggleMenu(12);">水瓶座</a></li>
          </ul>


        </nav>
      <div class="container">
          <div class="item" id="star-1">
            <div class="text">
                <h2>摩羯座</h2>
                <p>分析:<br/>1.魔羯座特別善於分析，任何事情都希望自己能多一點分析，這樣就可以有少一點失誤，所以在獨處的時候常常不斷地問自己問題。2.就是不喜歡人擠人，每個魔羯座都一定多少有點人群恐懼症，就算去約會也希望可以約個兩人獨處的地方，例如老書店、樓頂等。3.大家都說魔羯座不擅長感情這一方面的事情，他們是真的不擅長，但是真的不代表他就是不想要！魔羯一旦愛上一個人，就會特別容易陷入癡迷，深陷其中。4.和其他土象星座一樣，是屬於較內向，略帶憂鬱、內省、孤獨、保守、懷舊、消極、沒有安全感，也欠缺幽默感，常會裝出高高在上或是嚴厲的姿態，以掩飾自己內在的脆弱。</p>
            </div>
          </div>
          <div class="item"id="star-2">
            <div class="text">
                <h2>射手座</h2>
                <p>分析:<br/>感情上時而熱情如火，時而漠不關心。這種起伏不定的感情是造成失敗的原因，通常會有一個以上的戀情，很會體貼伴侶。在性格方面，是誠實，真心，坦白和值得信任的。在脾氣方面，對自己的朋友是仁慈大方的，在許多事情上都很圓滑，很懂得外交手腕。精神力量強,粗心大意、心直口快，容易得罪人、缺乏耐性、不懂人情世故、做事衝動、不懂三思而行</p>
            </div>
          </div>
          <div class="item"id="star-3">
            <div class="text">
                <h2>天秤座</h2>
                <p>分析:<br/>不喜歡表現出內心的真相。個性穩健而理智。有優秀的平衡感和公正的判斷力，善於協調，在相反的意見中往往能擔負起調停的責任。凡事講求邏輯和策略，絕對不以暴力解決事情，而是以巧妙的手腕，在對等的權利和利害中找出平衡點。八面玲瓏，頗有社交才華，容易搏得在上位者的眷顧和禮遇。天秤座有虛榮的一面，不喜歡顯示自己的缺點，總會把最好的一面表現出來，而且過份重視自己的外表，喜歡花錢在打分上，有時會被人誤為虛榮很重，做事有時也會猶豫不決難下抉擇，而失去很多機會。</p>
            </div>
          </div>
          <div class="item"id="star-4">
            <div class="text">
                <h2>雙子座</h2>
                <p>分析:<br/>雙子座的一個性格是脾氣乖戾的藝術家態度，另一個性格是明朗的社交家，這種雙重性格會使雙子座的人，生活發生矛盾，喜歡幻想，易滿足於沈思和白日夢,這星座的人有很多作家，新藝術的創始者，發明家，作曲家等等。優點是有潛在的藝術才能，缺點是有拖延的傾向，自私，不關心別人的感情和思想，神經質，不好相處,雙子座的人能言善道又善於交際，很容易跟別人打成一片，是個社交型且愛歡迎的人物，由於頭腦靈活，作事能隨機應變，並且有強烈的研究心，因此再困難的事情，他都能化繁為簡。</p>
            </div>
          </div>
          <div class="item"id="star-5">
            <div class="text">
                <h2>獅子座</h2>
                <p>分析:<br/>獅子座的人個性衝動，熱情，誠實而忠心，理想很高，莊嚴又偉大，有幽默感，天性快樂，會吸引很多人，對人很有禮貌而體貼。大方，性急，不會記恨太久，有活潑的想像力，興趣廣泛，健談,天生具天者風範的獅子座，有很強的領導能力，善於將自己最好的一面表現出來，行動積極做事總是充滿信心，是屬於領導型的人物。</p>
            </div>
          </div>
          <div class="item"id="star-6">
            <div class="text">
                <h2>處女座</h2>
                <p>分析:<br/>處女座的人勤奮，實際，慎重，誠實可靠，具有樂於助人的天性，有外交才能，儀容整潔而吸引人，講究衣著，有獨立的思想和觀察力。也有優越的分析能力和很快的領悟力,處女座天生喜愛整潔和精確，性喜純潔。有多愁善感，憂鬱的傾向。富於靈感及活潑的直覺而能了解別人個性和動機，為人謙虛，不和他人競爭，外觀好似消極，其實是決心堅定而腳踏實地的作風。初見沒有魄力，但工作態度非常細心，憑良心做事，守秩序。太過完美主義的處女座，是個很注重細節的星座，因此對別人的要求很高，一但不滿就會批評對方，因此對事情的看法切勿過份極端，會造成別人的反感。</p>
            </div>
          </div>
          <div class="item"id="star-7">
            <div class="text">
                <h2>金牛座</h2>
                <p>分析:<br/>金牛座的人有天生的審美感覺，喜歡漂亮而實用的物件。為人誠實、溫和、真心、可靠、順從，是別人可以信賴的人，有勇氣有耐心、堅定不移、有決斷力、有想像力和創新的思想，對經濟事務方面，態度穩健而值得信賴，也善於儲蓄。金牛座的性格特徵是謹慎，喜歡安逸的生活，行動之前都會三思而後行，且細心負摃，做事較少失敗。缺乏積極型金牛座非常頑固，比較堅持己見，認定的事會堅持到底，而且行動緩慢，總是慢半拍型</p>
            </div>
          </div>
          <div class="item"id="star-8">
            <div class="text">
                <h2>巨蟹座</h2>
                <p>分析:<br/>巨蟹座的人較保守，能享受歡樂，並結交朋友，不自私或虛榮，坦白，大方，正直，忠於朋友和個人的信仰，能夠託付以重要秘密職務或工作。有很好的領悟力和觀察力，喜歡沈思，非常專心，勤於分析自己的思想和衝動，想像力非常活躍,忠於愛情，重視家庭的溫暖與安定，擅理家務，重視家庭的和諧，是所有星座中最具家庭觀念的星座。巨蟹座的人容易跟著情緒走，提不起放不下、太過多愁善感、不知適可而止、缺乏理性思考、經不起打擊、說話拐彎抹角、不直接，過度保護自己,由於防衛比態很強，會讓人會有些不近人情。</p>
            </div>
          </div>
          <div class="item"id="star-9">
            <div class="text">
                <h2>牡羊座</h2>
                <p>分析:<br/>牡羊座的性格，可用一句話-「堅強」來代表。不論面對任何事情，都會全力以赴，牡羊的羊角正可用來說明這種個性。牡羊座的人，心中充滿正義感，以及強而有力的行動力，經常可以領導別人，坦誠的表達自己的意見，開朗的鼓勵同事，並受到別人的信賴和尊敬。富有正義感的熱情人物，活潑明朗，具有迷人的舉止和良好的心智能力，喜歡受人尊敬，善於外交，具有冒險及企業的精神，愛好各種活動，為人親切，有俠義之心，慷慨氣質。喜歡行動，是坦率型的，不願靜居家中，喜到處走，討厭受拘束,牡羊座凡事會往壞處想，是屬於悲觀主義者，太在意別人的看法而有些鑽牛角尖，由於牡羊座做事以行動為優先，戰門精神太強可能顯得衝動，給人有壓迫感。</p>
            </div>
          </div>
          <div class="item"id="star-10">
            <div class="text">
                <h2>雙子座</h2>
                <p>分析:<br/>雙子座多才多藝、見人說人話、見鬼說鬼話、足智多謀、反應靈敏、八面玲瓏、善於交際、懂得隨機應變、充滿生命力、擅長溝通、知進退，有分寸、適應力強、風趣幽默、適應力強、機智、敏捷、喜歡忙碌和變化、主動、活潑而健談、聰慧且多才多藝、具有寫作和語言方面的天才、對時尚有著敏銳的感受力，能夠永久維持著年輕和時髦的外貌。有廣博的學術涵養．適應力佳型。

                  雙子座的人能言善道又善於交際，很容易跟別人打成一片，是個社交型且愛歡迎的人物，由於頭腦靈活，作事能隨機應變，並且有強烈的研究心，因此再困難的事情，他都能化繁為簡。</p>
            </div>
          </div>
          <div class="item"id="star-11">
            <div class="text">
                <h2>雙魚座</h2>
                <p>分析:<br/>雙魚座的人是心地溫暖，感情豐富的，喜愛羅曼蒂克的氣氛。對任何人都很親切，很易投入他人的懷抱，信任他人。看到別人受傷害，往往忘卻自己能力，為他人努力，勞心，易信他人，為他人盡力，也想獲得他人的好感，若對方對你太過於現實，破壞你的夢幻和希望，你就會表示不滿心情大抱不平。個性消極的雙魚座，太容易相信別人，而本身缺乏自主能力，而且對自己的評價太低，尤其感受性很強，總是憑感覺判斷事情，會受別人的話所影響</p>
            </div>
          </div>
          <div class="item"id="star-12">
            <div class="text">
                <h2>水瓶座</h2>
                <p>分析:<br/>水瓶座愛好自由熱情、且有正義感、喜歡創新型。思想先遠崇尚自由的水瓶座是個喜愛交友的星座．對人非常友愛，給人的印象是善良、和諧，對任何事情的處理方式不守舊，喜歡創新並吸耳新知觀察力敏銳的他，對每件事總是充滿好奇心，是個有理想，求知慾強的星座。水瓶座太理想化、太強調合理事型。由於太過理想化的水瓶座，對事情總強調合理性與追根究底，因此難免給人有固執、冷漠的感覺。</p>
            </div>
          </div>
      </div>
    </div>
    

   
    
   <script src="index.js"></script>
  </body>
</html>
